{"text": " Welcome to our new episode of Janta's Night Talk. First of all, comment on our setup. And again, editor, please put wide angle so that people can see our entire setup. And also, this is going to be our last night talk on this channel. Because all our upcoming night talks are going to be on our new channel, Night Talk by Real Hit. We named the channel Night Talk. Because guys, there will be such things that will be fun to listen at night. Basically, we will be rude. Not even rude, there will be good things and the guests will be good. Fun talks. And before moving ahead, let me tell you that our partners of this episode are Adil Qadri Perfumes. Perfumes are available in amazing fragrances on their website. We were going to visit Thailand and there was a story related to perfumes. Piyush will tell you about it. But for now, let's move on. Deepak, over to you. You have opened the title of this podcast. Thailand's going to be discussed. For those who haven't been to Thailand and want to go there, we are going to talk about everything. And for that we have Khushi and Yashika with us. Khushi has gone to Bangkok and Pattaya. We have recently been to Chiang Mai, Koh Samui and Phuket. And we have also been to Bangkok. We have been there 3 times in a year. It feels like we have been there so many times. We are not in the mood to go there. We have also celebrated New Year's there. And we have also celebrated this one. It must have become common for you. But we explored more places. This time we were in Chiang Mai and there were only Indians. I would have seen 2-3 faces there. Apart from that, we were 5 Indians there. But the main places like Bangkok, Pattaya, you will meet a lot of Indians there. There are a lot of Indians in Pattaya. There are a lot of Indians there. The atmosphere is a bit bad there. But we try to go to different places like Phi Phi Island, Koh Samui and Chiang Mai. So, there is no Indian at all. The atmosphere is bad. Explain to the people how the atmosphere is bad. The atmosphere is bad because the Thailand thing is famous that whenever you tell someone that you are going to Thailand, they laugh at you. Oh, you are going to Thailand for that thing. So, there is a lot. There is a lot of Bangkok Pattaya. We were in Chiang Mai. There was nothing. When you go to Bangkok, there are hookers on the street. But in Chiang Mai, you won't see anyone standing on such a street. It's also in Phuket but less in Bangkok because there's a lot of it in Bangkok. There are a lot of Indians in Bangkok's walking street. We're talking about the ladyboys who stand there. Yes, that's a walking street. If you stand there for 2 minutes, then you'll... I have not been to Phuket but I don't know about there. We were in the market in Bangkok, Sukhumvit area. People were standing there too. But in Phuket, when there is a party in the walking street at 12-1 pm, you will see people standing in Phuket. But you won't find people in normal streets. But you will see people roaming around in Bangkok. In Pattaya, yes. It is very common. You will see people there even during the day. Did you go on a girls trip? I actually went on a shoot. I extended the trip. Me and my friend, there were a lot of people who came to shoot there. So we extended the trip. Was the trip sponsored? It was sponsored. Then it must have been more fun. But when you said you would extend it, you must have thought why did you do it? I had a lot of fun there because it was my first trip. I was on a plane for the first time and I went straight to Thailand. Outside India. Wow! When you told your family that you were going to Thailand, I don't think girls would react like that. They were asking me why I was going to Bangkok. I told them that I was going to Bangkok. My friends were also asking me why I was going to Bangkok. So, that's it. I have some bad reputation. Tell us about your trip. I went with my friend. There were a lot of people there. Some girls came from Mumbai. Some actors came. Let's make it a little more informative for the audience. When you went, what was the time, how much did you take the ticket and how did you reach there? What was the hotel? I don't know all this. It was sponsored. It was all sponsored. I don't know all these things so they must be knowing. I just went there and enjoyed. Did you get massages done there? Yes, I got foot massage done. You didn't get a full body massage? No, we went but we were scared. We didn't get a full body massage. What were you scared of? We went for the famous thing but not for the full body. We went for foot massage and back massage. Because there are famous ladyboys. In good massage centers, the old ladies come. They massage with their hands and it feels like they have gone and massaged their body. You have to walk a lot. You can take a tuk-tuk but you have to walk a lot. We used to go to hotels and explore, eat and drink. We used to get foot, back or head massage. Then we used to walk and get pain in the legs. You always feel the need to get massage. You get tired instantly. You get energy from getting massage. This happens. People go for massage and then they go out when they get in a mood. It depends on the person. Nightlife and clubbing is crazy there. We have been to Phuket and it's crazy. Bangkok's Khaosan Road is good but there's a different street. Phuket has a club called Illusion Club. Illusion Club is amazing. There's a free entry. There's an Illusion Club and Sugar Club. Both are amazing. There is a massive club party in front of the city. We went to Kosa Mui, which has more bars and beach parties. But there is a massive club. But there also, the clubs deal with the people who come to the club. They make a deal with the people to go to them and get drinks. So that they can get into the mood. Their main motive is to make a bill. Yes, exactly. They would be there and they would order and they would get the bills made. I was saying that we had gone to Pattaya, a walking street club. There, Indians had left their girls there. They were dancing with them. We could see some married, bachelorette. We were watching them. What's going on? We came from India and it was so much fun. In India, we go to uncle's house more. We get our hair oiled there. But if you had gone there, you wouldn't have had any problem in eating. We were vegetarians. We had a lot of problems. Most of the people were vegetarians with us. They had a lot of problems. There is no veg in McDonald's or Burger King. There is only one burger in Burger King. There is only one plant-based burger in Burger King. I know how I spent the night in Chiang Mai. We were in Chiang Mai in a club. But there was nothing there except beef, pork, chicken and fish. And only french fries and cheese sticks were available in veg. Wherever I have been, I have had french fries in all the patayas in Bangkok. This is what happens there. Not just my friends, but I have had french fries. So if you are going and you are a vegetarian, then you will have a problem. And you get Indian restaurants. I have heard that normal fish oil is also used there. Due to which there is a lot of fish smell in the air. The smell of food is everywhere. You saw the crocodile there. They were roaming around. They were cutting the canes and feeding them. They were walking on the walking street with the canes. Like lollipops. They would bring it to their mouth. Do you remember the reels we used to see? There were insects in it. We used to put spices in it and shake it. There are similar markets but we were far from them. I saw a stall where octopus and fish are alive but they are not boiling in water. They are ready to eat. They eat alive. This is their account. It's very dangerous. If you are going to Thailand, go to the island. I mean to say this to my audience. Because you will enjoy it there. So Koh Samui and Chiang Mai are very good. Fifi is also very good. Chiang Mai is not an island. It's not an island. Chiang Mai is a hill station. But Fifi, Krabi, Koh Phangan and Koh Samui are 4 places. They are very strong places. And Indians are very less here. There are a lot of backpackers. And stay here in a hostel. You will meet friends in the hostel. Take them to a party at night. And make your friend ready. Hostels are fun when there is interaction with people. Because one is that you are living in luxury, you are not enjoying it, you are living in your own home. You interact with people in the hostel. Foreigners, foreigners, and when you see foreigners, you get a lot of laughter that they are all chindis. Yes. All are chindis. They are poor. That means even if they have to pay 120-250 rupees, they are new. We say that their currency is good. In their currency, they get more money, they can enjoy it. But Indians are enjoying it more. So, you were saying that Indians are more popular. Indians are very popular. So, Indians fly a lot. Shocking. I remember one story. We went clubbing in Chiang Mai. There was a club called Spicy. Okay. So, Shivam and I were outside the club. Two girls came out from there. So, we asked them how the club was inside. Should we go inside or not? It's busy inside. Is it happening or not? So, we thought it's over. That's why it's going out. We said, is it over or is it a party inside? They said, no, no. There's a lit inside. I asked him why he was going out. He said he didn't go inside. He just saw that the party was going on. He said he had to buy a drink for 250 Baht. I asked him what is the difference between 250 and 250? He said it was too expensive. I asked him if he was a Chinese or Englishman. And that too for two people. Yes, I was a German. We were with the people from Denmark. You, me and Shivam were there. We were brothers and sisters. We asked them where they were going to party next. They said there was an underground club in Chiang Mai. I said it could be a scam. Because there are scams going on there. I'll tell you later. It could be a scam. You go to Spicy. We go there everyday. After this, there's Spicy Club. You have to buy a drink. and you will get entry. So, they said no, we will go here because we are getting free shot. I said it will be a scam with you. What kind of scams are there? Scams are there where beautiful girls will come to you. You are in a club, there are two famous clubs Zoey Niello in Chiang Mai. It is in a street where there are many clubs So what happens there is that a beautiful girl comes and talks to you and you think wow, she is talking in another club, that's good. Then she says that it gets closed till 1.5-2.5. Now where do you want to party? So she says let's go to that club. Spicy. Spicy is genuine but she takes the name of different clubs. By the boom. They take the club's name separately. You are a traveller and you don't know about the club. The local girl is telling you that it's a good place so you think you should go. But their main work is to get you entered and you will get expensive drinks. Normally, a 100 Baht drink will cost you 500 Baht. Basically, you will get a bill of 5-6 thousand Baht. 10-12 thousand and then you will get a bullet at your home. So, this is how the scam is going on. I saw this podcast and thought of going to Thailand. So, be careful with these things. Yashika, you are also careful. Because even boys can do this work. I mean, boys do less work because there are no boys there. There are more boys. The boys are girls there. There are very few Thai boys there. Girls are seen everywhere. Girls are seen on the walking street. Girls are seen everywhere. Because girls work there a lot. But it is fun to party there. Everyone comes there to talk to themselves. Like you are dancing, people come to talk to you. Boys and girls are open. There is an open culture. In India, people are reserved. They don't talk to me. Girls are also reserved. But Indian girls and girls from abroad talk to each other normally. Boys also come to talk to me. If a girl is standing, and you are standing single, they come and say, Hey bro, where are you from? What's your name? Wanna smoke? I had a lot of friends who were asking me about my perfume. He asked me what perfume I use and I told him that I use Adil Qadri's perfume. And I have also brought for you today. Look at this. Shanaya. Adil Qadri's Shanaya. Shanaya is their best seller I guess. It's really good. I had used this one. And I got a compliment. You can buy it. There are many different fragrances and options. And you will enjoy it when you get a compliment like I got. Really? You should also use it. Yes, because if you are going somewhere to impress girls, perfume is very important. Girls, do you agree? I agree because fragrance is the first element that attracts girls towards... They notice. They notice a lot. They don't do it in India. In India, they do it everywhere. They do it in India but they don't talk. Your fragrance is getting compliments, that means it is genuinely good. Wow! Because girls don't compliment everyone's fragrance. Then I agree with you. Coming back to the topic, we boys went on a trip. Have any of you been on a girls trip? I want to know how a girls trip is. What is the atmosphere like? What do you enjoy? We went on a girls trip together. We went to Rajasthan. Actually, we used to work at a place. We used to shoot basically. We were models from there. We went on a girls trip. We were friends and colleagues. We went on a trip to Rajasthan. We didn't go anywhere. We stayed there and had a party. We had a lot of fun. Was it a clubbing type party? No, it was a house party. We were chilling in the room. We set up the party outside. We had a lot of fun. Yashika will tell us more. What was your experience? Tell me, do girls stay? How does it happen? Basically, it was an official party. It was an official trip in which... Was this also sponsored? Yes, obviously. Why do you always get sponsored girls? I want to know about you. You are unofficial. You are friends. You know each other. The atmosphere is good. And then, you are on a girls trip. There have been many such trips. In school time, this must have been very rare. Like, I was in sports. All our friends used to come in the same sport. Like the tug of war. So that we all go to the nationals together. There are nationals for tug of war too? Yes. I am an international player in jump rope. Jump rope? Skipping? Yes, jumping rope. International? Yes. Wow! So where was your competition? I have been to Bhutan and once I was in London. Really? Yes. I represented India. You went to India? Wow! Respect! I have represented India. That's different. I didn't eat anything there. I lived on fruits. Because this problem with vegetarians is there in every country. Because you don't get anything to eat. But in London, it's easily available. It's not like that. Now that people are becoming vegan, it's easy. I mean, I went 7-8 years ago. So, it wasn't then. Now it's available. So, those things. Tell me about girl strip. What do you do when you go? Like I am telling about boys. What do we do? Before clubbing, we do some pre-boosts in our rooms or when we go out. We drink in our rooms too. We make fun of each other. What do you do? Do you do pre-boosts or not? Do you go clubbing or do you go and grab someone else? What happens? Or do you get jealous of each other that you look better? I would like to say this on this topic. Basically, when girls get together, they will fight and get into a fight. Girls get into a lot of fights and get jealous. We also have a lot of fun. We talk about small topics like boys, relationships, dance, etc. We don't do previews. I don't consume alcohol. Yashika doesn't either. I'll ask this question off camera again. We don't do pre booze but we do a lot of fun without booze. We do a lot of fun. So you don't go clubbing? No. I'll tell you one thing, boys need some tonics to have fun. A compliment is enough to have fun with a girl. She climbs on the roof like this. And when it's a girl's trip, it's not like it's a girl's trip. I mean, it's okay that there are fights and fights. But at that time, every girl is more interested in living that moment. And if no one is giving a compliment, then how will it be? It's between the two of them. It's not necessary. If a girl gives a compliment to a boy, if someone tells me that I'm beautiful, the girl is giving it genuinely. Otherwise, girls are jealous and don't give compliments. She doesn't give it out of jealousy. She just says it out of jealousy. If Yashika says that I am beautiful, then she is genuinely beautiful. Because girls don't compliment each other. They are jealous of each other. Mostly. So, they talk about their problems. But girls have a good habit of"}